Revit 2027 API
DuctSettings.UseAnnotationScaleForSingleLineFittings Property
 Indicates whether use annotation scale for single line fittings or not.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
Public Property UseAnnotationScaleForSingleLineFittings As Boolean
	Get
	Set
public:
property bool UseAnnotationScaleForSingleLineFittings {
	bool get ();
	void set (bool value);
}
member UseAnnotationScaleForSingleLineFittings : bool with get, set
Property Value
Boolean
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace